import 'package:flutter_application_1/domain/task.dart';

class Tasks {
  final List<Map<dynamic, dynamic>> tasks = [
    {
      'Непозиційні системи числення': {},
      'Позиційні системи числення': {
        '0': TypeTask(
          task: "Запишіть римські числа арабськими числами: XVII",
          answer: "17",
        ),
        '1': TypeTask(
          task: "Запишіть римські числа арабськими числами: CLXVI",
          answer: "166",
        ),
        '2': TypeTask(
          task: "Запишіть римські числа арабськими числами: MCDVIII",
          answer: "1408",
        ),
      },
      'Переведення чисел з однієї системи числення в іншу': {},
      'Двійкова система числення': {},
      'Задачі з натуральними числами в різних системах числення': {},
    },
    {
      'Прості і складені числа': {
        '0': TypeTask(
          task:
              "Знайдіть усі пари простих чисел, що відрізняються одне від одного на 17. Скільки ви отримали таких пар?",
          answer: "1",
        ),
        '1': TypeTask(
          task:
              "Прості числа мають тільки два різні дільники. Поміркуйте, а які числа мають тільки три різні дільники?",
          answer: "13",
        ),
      },
      'Ознаки подільності': {},
      'НСД і НСК': {},
      'Властивості подільності': {},
      'Розкладання на прості множники': {},
    },
    {
      'Частки і поділи': {},
      'Переливання рідини': {},
      'Зважування на терезах': {},
    },
    {
      'Фокуси із числами та арифметичними діями ': {},
      'Математичні фокуси з геометричними фігурами': {},
      'Математичні фокуси з предметами': {},
    },
    {
      'Симетрія': {},
      'Розрізання фігур': {},
      'Задачі на розфарбування': {},
    }
  ];

  Tasks();

  getTask(String unitName) {
    List list = unitName.split("/");
    print(unitName);
    return tasks[int.parse(list[1]) - 1][list[2]][list[3]];
  }
}
